ymaps.ready(init);

function init() {
    // Создаем карту.
    var myMap = new ymaps.Map("map", {
            center: [55.72, 37.44],
            zoom: 10
        }, {
            searchControlProvider: 'yandex#search'
        });

    // Создаем ломаную, используя класс GeoObject.
    var myGeoObject = new ymaps.GeoObject({
            // Описываем геометрию геообъекта.
            geometry: {
                // Тип геометрии - "Ломаная линия".
                type: "LineString",
                // Указываем координаты вершин ломаной.
                coordinates: [
                    [55.80, 37.50],
                    [55.70, 37.40]
                ]
            },
            // Описываем свойства геообъекта.
            properties:{
                // Содержимое хинта.
                hintContent: "Я геообъект",
                // Содержимое балуна.
                balloonContent: "Меня можно перетащить"
            }
        }, {
            // Задаем опции геообъекта.
            // Включаем возможность перетаскивания ломаной.
            draggable: true,
            // Цвет линии.
            strokeColor: "#FFFF00",
            // Ширина линии.
            strokeWidth: 5
        });

    // Создаем ломаную с помощью вспомогательного класса Polyline.
    var myPolyline = new ymaps.Polyline([
            // Указываем координаты вершин ломаной.
            [55.80, 37.50],
            [55.80, 37.40],
            [55.70, 37.50],
            [55.70, 37.40]
        ], {
            // Описываем свойства геообъекта.
            // Содержимое балуна.
            balloonContent: "Ломаная линия"
        }, {
            // Задаем опции геообъекта.
            // Отключаем кнопку закрытия балуна.
            balloonCloseButton: false,
            // Цвет линии.
            strokeColor: "#000000",
            // Ширина линии.
            strokeWidth: 4,
            // Коэффициент прозрачности.
            strokeOpacity: 0.5
        });

    // Добавляем линии на карту.
    myMap.geoObjects
        .add(myGeoObject)
        .add(myPolyline);
};


let routes = [
{ name:"Нижний Новгород - Москва",
  types: "Цистерны",
  stops:[
    {name: "Нижний Новгород", x: 56.31332270042888, y: 43.908291634351734},
    {name: "Гороховец", x: 56.20299912984716, y: 42.70224103113223},
    {name: "Камешково", x: 56.361889214168826, y: 41.087250796757225},
    {name: "Владимир", x: 56.12125124623075, y: 40.39483895704827},
    {name: "Собинка", x: 56.010333835333846, y: 39.96348319697085},
    {name: "Петушки", x: 55.93486398774311, y: 39.41142020868961},
    {name: "Сородищи", x: 55.867987707409306, y: 39.00691404264498},
    {name: "Черноголовка", x: 55.9867223601104, y: 38.34498777311374},
    {name: "Москва", x: 55.73494270124491, y: 37.63636960905125}]
},
{ name:"Москва - Нижний Новгород",
  types: "Цистерны",
  stops:[
    {name: "Москва", x: 55.73494270124491, y: 37.63636960905125},
    {name: "Черноголовка", x: 55.9867223601104, y: 38.34498777311374},
    {name: "Сородищи", x: 55.867987707409306, y: 39.00691404264498},
    {name: "Петушки", x: 55.93486398774311, y: 39.41142020868961},
    {name: "Собинка", x: 56.010333835333846, y: 39.96348319697085},
    {name: "Владимир", x: 56.12125124623075, y: 40.39483895704827},
    {name: "Камешково", x: 56.361889214168826, y: 41.087250796757225},
    {name: "Гороховец", x: 56.20299912984716, y: 42.70224103113223},
    {name: "Нижний Новгород", x: 56.31332270042888, y: 43.908291634351734}]
},
{ name: "Пермь - Тюмень",
  types: ["Цистерны", "Для сыпучих товаров"],
  stops:[
    {name: "Пермь", x: 58.006706577943625, y: 56.21648392839895},
    {name: "Нижний Тагил", x: 57.913275817151884, y: 59.951835490898965},
    {name: "Екатеринбург", x: 56.85125583273868, y: 60.57805619402396},
    {name: "Каменск-Уральский", x: 56.42477569484866, y: 61.88779601812611},
    {name: "Тюмень", x: 57.14835242793901, y: 65.53525695562611}]
},
{ name: "Тюмень - Пермь",
  types: ["Цистерны", "Для сыпучих товаров"],
  stops:[
    {name: "Тюмень", x: 57.14835242793901, y: 65.53525695562611},
    {name: "Каменск-Уральский", x: 56.42477569484866, y: 61.88779601812611},
    {name: "Екатеринбург", x: 56.85125583273868, y: 60.57805619402396},
    {name: "Нижний Тагил", x: 57.913275817151884, y: 59.951835490898965},
    {name: "Пермь", x: 58.006706577943625, y: 56.21648392839895}]
},
{ name: "Воронеж - Калуга",
  types: ["Цистерны", "Термо-вагоны"],
  stops:[
    {name: "Воронеж", x: 51.65424336976501, y: 39.19226052494886},
    {name: "Липецк", x: 52.627584130876926, y: 39.609740993698864},
    {name: "Новомосковск", x: 54.01861572673241, y: 38.28302583484658},
    {name: "Калуга", x: 54.51235925694487, y: 36.26226884651411}]
},
{ name: "Калуга - Воронеж",
  types: ["Цистерны", "Термо-вагоны"],
  stops:[
    {name: "Калуга", x: 54.51235925694487, y: 36.26226884651411},
    {name: "Новомосковск", x: 54.01861572673241, y: 38.28302583484658},
    {name: "Липецк", x: 52.627584130876926, y: 39.609740993698864},
    {name: "Воронеж", x: 51.65424336976501, y: 39.19226052494886}]
},
{ name: "Великий Новгород - Иваново",
  types: ["Для контейнеров", "Термо-вагоны"],
  stops:[
    {name: "Великий Новгород", x: 58.51894280392871, y: 31.270212371577855},
    {name: "Боровичи", x: 58.37495250568406, y: 33.873972137202855},
    {name: "Тверь", x: 56.87215803820237, y: 35.85151119970286},
    {name: "Иваново", x: 56.99828433812811, y: 40.94916744970286}] 
}, 
{ name: "Иваново - Великий Новгород",
  types: ["Для контейнеров", "Термо-вагоны"],
  stops:[
    {name: "Иваново", x: 56.99828433812811, y: 40.94916744970286},
    {name: "Тверь", x: 56.87215803820237, y: 35.85151119970286},
    {name: "Боровичи", x: 58.37495250568406, y: 33.873972137202855},
    {name: "Великий Новгород", x: 58.51894280392871, y: 31.270212371577855}] 
},
{ name: "Пенза - Казань",
  types: ["Термо-вагоны", "Для сыпучих товаров"],
  stops:[
    {name: "Пенза", x: 53.19551145668138, y: 45.028256394535234},
    {name: "Саранск", x: 54.212381210579245, y: 45.14910600391022},
    {name: "Чебоксары", x: 56.12987806002358, y: 47.19256303516021},
    {name: "Казань", x: 55.821865921078434, y: 49.01629350391022}]
},
{ name: "Казань - Пенза",
  types: ["Термо-вагоны", "Для сыпучих товаров"],
  stops:[
    {name: "Казань", x: 55.821865921078434, y: 49.01629350391022},
    {name: "Чебоксары", x: 56.12987806002358, y: 47.19256303516021},
    {name: "Саранск", x: 54.212381210579245, y: 45.14910600391022},
    {name: "Пенза", x: 53.19551145668138, y: 45.028256394535234}]
},
{ name: "Ярославль - Ижевск",
  types: ["Для сыпучих товаров", "Цистерны"],
  stops:[
    {name: "Ярославль", x: 57.63675369117618, y: 39.870646287622264},
    {name: "Кострома", x: 57.75440532333334, y: 40.92533378762227},
    {name: "Йошкар-Ола", x: 56.62113696557166, y: 47.89066581887226},
    {name: "Ижевск", x: 56.85058824495181, y: 53.09818535012226}]
},
{ name: "Ижевск - Ярославль",
  types: ["Для сыпучих товаров", "Цистерны"],
  stops:[
    {name: "Ижевск", x: 56.85058824495181, y: 53.09818535012226},
    {name: "Йошкар-Ола", x: 56.62113696557166, y: 47.89066581887226},
    {name: "Кострома", x: 57.75440532333334, y: 40.92533378762227},
    {name: "Ярославль", x: 57.63675369117618, y: 39.870646287622264}]
}
]
